codeigniter/app/Controllers/Home.php

      public function main()
      {
          // Check if user is logged in
          if (!auth()->loggedIn()) {
              return redirect()->to('login')->with('error', 'You need to be logged in to access this page.');
          }

          // Get the currently logged in user
          $user = auth()->user();

          // Load the TokenSsoModel
          $tokenModel = new TokenSsoModel();

          // Get the token for the logged in user
          $tokenData = $tokenModel->where('id_usuario', $user->id)->first();
---
SELECT *
FROM `token_sso`
WHERE `id_usuario` = 2
 LIMIT 1