codeigniter/app/Models/TokenSsoModel.php

    public function saveToken(int $userId, string $token): bool
    {
        // Buscar si ya existe un registro para el usuario
        $existingToken = $this->where('id_usuario', $userId)->first();
---
SELECT *
FROM `token_sso`
WHERE `id_usuario` = 2
 LIMIT 1